ASObjectsAPI.Grid.updateWidth(System.Double)
Update the Width of the Grid
For a Grid1D this becomes the length of each GridElement (Axis)

ASObjectsAPI.Grid.updateLength(System.Double)
Update the Length of the Grid
For a Grid1D this becomes the sum of all the spacings between successive GridElements (Axis)

ASObjectsAPI.Grid.AddSequence(System.Int32,System.Double)
Adds a sequence after the last GridElement
If the spacings between GridElements are the same as the previous sequence, the two sequences will be combined into one

ASObjectsAPI.Grid.GetNumSequences
Gets the number of sequences in the Grid

ASObjectsAPI.Grid.GetAllElements(AstArray&lt;ASObjectsAPI.GridElement**,AstArrayObjectCopyReallocator&lt;ASObjectsAPI.GridElement**&gt;,AstArrayMemoryController&lt;ASObjectsAPI.GridElement**&gt;&gt;*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Gets all of the Grid's elements, including neighbors
Each element contains information about an axis and it's label

ASObjectsAPI.Grid.getNumElements
Gets the number of elements in the Grid